[
    {
        "bookName": "abudawud",
        "hadithNumber": ":2829",
        "hadithText": "(the narrator Musa did not mention the words \"from 'Aishah\" in his version from Hammad, and al-Qa'nabi also did not mention the word \"from 'Aishah\" in his version from Malik). They (the people) said: Messenger of Allah, there are people here, recent converts from polytheism, who bring us meat and we do not know whether or not they mentioned Allah's name over it. The Messenger of Allah (saws) said: Mention Allah's name and eat.",
        "hadithReference": "Sunan Abi Dawud 2829",
        "hadithNarrated": "Narrated 'Aishah:"
    },
    {
        "bookName": "abudawud",
        "hadithNumber": ":371",
        "hadithText": "He witnessed me rubbing off the semen from the clothe of the Messenger of Allah (saws).\n\n\nAbu Dawud said: Al-A'mash narrated it as narrated by al-Hakam.",
        "hadithReference": "Sunan Abi Dawud 371",
        "hadithNarrated": "Hammam b. al-Harith reported, he has a sexual dream when he was staying with 'Aishah. The slave girl of 'Aishah saw him while he was washing the mark of defilement, or he was washing his clothe. She informed 'Aishah who said:"
    },
    {
        "bookName": "abudawud",
        "hadithNumber": ":410",
        "hadithText": "'Aishah commanded me to write for her come passage from the Qur'an. She also added: When you reach the following verse, inform me: \"Be guardian of your prayers and of the midmost prayer\" (2:238). When I reached it, I informed her. She asked me to write: \"Be guardians of your prayers, and of the midmost prayer, and of the 'Asr prayer, and stand up with devotion of Allah\" (2:238). 'Aishah then said: I heard it from the Messenger of Allah (saws).",
        "hadithReference": "Sunan Abi Dawud 410",
        "hadithNarrated": "Abu Yunus, the freed slave of 'Aishah said:"
    },
    {
        "bookName": "ibnmajah",
        "hadithNumber": ":565",
        "hadithText": "\"Aishah dropped a necklace and stayed behind to look for it. Abu Bakr went to 'Aishah and got angry with her for keeping the people waiting. Then Allah revealed the concession allowing dry ablution, so we wiped our arms up to the shoulders. Abu Bakr went to 'Aishah and said: 'I did not know that you are blessed.'\"",
        "hadithReference": "Sunan Ibn Majah 565",
        "hadithNarrated": "It was narrated that 'Ammar bin Yasir said:"
    },
    {
        "bookName": "mishkat",
        "hadithNumber": ":323",
        "hadithText": "‘A’isha said that the Prophet used to kiss one of his wives and then pray without performing ablution. \n\nAbu Dawud, Tirmidhi, Nasa’i and Ibn Majah transmitted it. Tirmidhi said, “The isnad ‘Urwa from\n‘A'isha is in no way sound in the opinion of our friends,* and the same applies to the isnad Ibrahim at-Taimi from her.” \nAbu Dawud said that this is mursal and that Ibrahim at-Taimi never heard from ‘A'isha.\n*This must apply to this particular tradition, as ‘Urwa is a recognised transmitter from ‘A'isha",
        "hadithReference": "Mishkat al-Masabih 323",
        "hadithNarrated": "Unknown"
    },
    {
        "bookName": "adab",
        "hadithNumber": "/53/4",
        "hadithText": "Umm 'Alqama related that when the daughters of 'A'isha's brother\nwere circumcised, 'A'isha was asked, \"Shall we call someone to amuse them?\"\n\"Yes,\" she replied. 'Adi was sent for and he came to them. 'A'isha passed\nby the room and saw him singing and shaking his head in rapture - and\nhe had a large head of hair. 'Uff!' she exclaimed, 'A shaytan! Get him\nout! Get him out!'\"",
        "hadithReference": "Unknown",
        "hadithNarrated": "Unknown"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":2726",
        "hadithText": "When I visited Aisha she said, \"Barirah who had a written contract for her emancipation for a certain \namount came to me and said, \"O mother of the believers! Buy me and manumit me, as my masters \nwill sell me.\" Aisha agreed to it. Barirah said, 'My masters will sell me on the condition that my Wala \nwill go to them.\" Aisha said to her, 'Then I am not in need of you.' The Prophet heard of that or was \ntold about it and so he asked Aisha, 'What is the problem of Barirah?' He said, 'Buy her and manumit \nher, no matter what they stipulate.' Aisha added, 'I bought and manumitted her, though her masters \nhad stipulated that her Wala would be for them.' The Prophet said, The Wala is for the liberator, even \nif the other stipulated a hundred conditions.\"",
        "hadithReference": "Sahih al-Bukhari 2726",
        "hadithNarrated": "Narrated Aiman Al-Makki:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":4450",
        "hadithText": "`Aisha said, \"Allah's Apostle in his fatal illness, used to ask, 'Where will I be tomorrow? Where will I \nbe tomorrow?\", seeking `Aisha's turn. His wives allowed him to stay wherever he wished. So he \nstayed at `Aisha's house till he expired while he was with her.\" `Aisha added, \"The Prophet expired on \nthe day of my turn in my house and he was taken unto Allah while his head was against my chest and \nhis saliva mixed with my saliva.\" `Aisha added, \"Abdur-Rahman bin Abu Bakr came in, carrying a \nSiwak he was cleaning his teeth with. Allah's Apostle looked at it and I said to him, 'O \n`AbdurRahman! Give me this Siwak.' So he gave it to me and I cut it, chewed it (it's end) and gave it \nto Allah's Apostle who cleaned his teeth with it while he was resting against my chest.\"",
        "hadithReference": "Sahih al-Bukhari 4450",
        "hadithNarrated": "Narrated `Urwa:"
    },
    {
        "bookName": "abudawud",
        "hadithNumber": ":710",
        "hadithText": "I was sleeping in front of the Prophet (saws) with my legs between him and the qiblah. Shu'bah said: I think she said: I was menstruating.\n\n\nAbu Dawud said: This tradition has been narrated by al-Zuhri, 'Ata, Abu Bakr b. Hafs, Hisham b. 'Urwah, 'Irak b. Malik, Abu al-Aswad and Tamim b. Salamah; all transmitted from 'Urwah on the authority of 'Aishah. Ibrahim narrated from al-Aswad on the authority of 'Aishah. Abu al-Duha narrated from Masruq on the authority of 'Aishah. Al-Qasim b. Muhammad and Abu Salamah narrated it from 'Aisha. All these narrators did not mention the words \"And I was menstruating.\"",
        "hadithReference": "Sunan Abi Dawud 710",
        "hadithNarrated": "Narrated Aisha, Ummul Mu'minin:"
    },
    {
        "bookName": "abudawud",
        "hadithNumber": ":290",
        "hadithText": "\"She used to take a bath for every prayer.\"\n\n\nAbu Dawud said: Al-Qasim b. Mabrur reported from Yunus from Ibn Shihab from 'Amrah from 'Aishah from Umm Habibah daughter of Jahsh. Similarly, it was reported by Ma'mar from al-Zuhri from 'Amrah from 'Aishah. Ma'mar sometimes reported from 'Amrah on the authority of Umm Habibah to the same effect. Similarly, it was reported by Ibrahim b. Sa'd and Ibn 'Uyainah from al-Zuhri from 'Amrah from 'Aishah. Ibn 'Uyainah said in his version: He (al-Zuhri) did not say that the Prophet (saws) commanded her to take bath.\n\n\nIt has also been transmitted by al-Awza'i in a similar way. In this version he said: 'Aishah said: She used to take bath for very prayer.",
        "hadithReference": "Sunan Abi Dawud 290",
        "hadithNarrated": "This has bee\tn narrated though a different chain of narrators by 'Aishah. This version has the words:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":2565",
        "hadithText": "I went to `Aisha and said, \"I was the slave of `Utba bin Abu Lahab. \"Utba died and his sons became \nmy masters who sold me to Ibn Abu `Amr who manumitted me. The sons of `Utba stipulated that my \nWala' should be for them.\" `Aisha said, \"Barirah came to me and she was given the writing of \nemancipation by her masters and she asked me to buy and manumit her. I agreed to it, but Barirah told \nme that her masters would not sell her unless her Wala' was for them.\" `Aisha said, \"I am not in need \nof that.\" When the Prophet heard that, or he was told about it, he asked `Aisha about it. `Aisha \nmentioned what Barirah had told her. The Prophet said, \"Buy and manumit (free) her and let them stipulate \nwhatever they like.\" So, `Aisha bought and manumitted her and her masters stipulated that her Wala' \nshould be for them.\" The Prophet;, said, \"The Wala' will be for the liberator even if they stipulated a \nhundred conditions.\"",
        "hadithReference": "Sahih al-Bukhari 2565",
        "hadithNarrated": "Narrated `Abdul Wahid bin Aiman:"
    },
    {
        "bookName": "tirmidhi",
        "hadithNumber": ":3879",
        "hadithText": "\"The people used to give their gifts [to the Prophet (SAW)] on 'Aishah's day.\" She said: \"So my companions gathered with Umm Salamah and they said 'O Umm Salamah! The people give their gifts on 'Aishah's day, and we desire good as 'Aishah desires, so tell the Messenger of Allah (SAW) to order the people to give (their gifts to) him no matter where he is.' So Umm Salamah said that, and he turned away from her. Then he turned back to her and she repeated the words saying: 'O Messenger of Allah! My companions have mentioned that the people give their gifts on 'Aishah's day, so order the people to give them no matter where you are.' So upon the third time she said that, he said: 'O Umm Salamah! Do not bother me about 'Aishah! For Revelation has not been sent down upon me while I was under the blankets of a woman among you other than her.'\"",
        "hadithReference": "Jami` at-Tirmidhi 3879",
        "hadithNarrated": "Narrated 'Aishah:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":1290",
        "hadithText": "I wish I had also sought permission from Allah's Messenger (may peace be upon him) as Sauda had. sought permission from him. 'A'isha did not proceed but with the Imam.",
        "hadithReference": "Sahih Muslim 1290 b",
        "hadithNarrated": "A'isha (Allah be pleased with her) reported that (hadrat) Sauda was a bulky lady, so she sought permission from Allah's Messenger (may peace be upon him) to proceed from Muzdalifa (to Mina) in the (latter part of the) night. He granted her permission. 'A'isha said:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":2107",
        "hadithText": "Allah's Messenger (may peace be upon him) visited me. and I had a shelf with a thin cloth curtain hangin. over it and on which there were portraits. No sooner did he see it than he tore it and the colour of his face underwent a change and he said: A'isha, the most grievous torment from the Hand of Allah on the Day of Resurrection would be for those who imitate (Allah) in the act of His creation. A'isha said: We tore it into pieces and made a cushion or two cushions out of that.",
        "hadithReference": "Sahih Muslim 2107 i",
        "hadithNarrated": "A'isha reported:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":2165",
        "hadithText": "As-Sam-u-'Alaikum. A'isha said in response: As-Sam-u-'Alaikum (death be upon you) and curse also, whereupon Allah's Messenger (may peace be upon him) said: 'A'isha, verily Allah loves kindness in every matter. She said: Did you bear what they said? Thereupon he said: Did you not hear that I said (to them): Wa 'Alaikum.",
        "hadithReference": "Sahih Muslim 2165 a",
        "hadithNarrated": "'A'isha reported that a group of Jews came to Allah's Messenger (may peace be upon him) and sought his audience and said:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":2165",
        "hadithText": "Abu'l-Qasim (the Kunya of the Holy Prophet), as-Sam-u-'Alaikum, whereupon he (the Holy Prophet) said: Wa 'Alaikum. A'isha reported: In response to these words of theirs, I said: But let there be death upon you and disgrace also, whereupon Allah's Messenger (may peace be upon him) said: 'A'isha, do not use harsh words. She said: Did you hear what they said? Thereupon he (the Holy Prophet) said: Did I not respond to them when they said that; I said to them: Wa 'Alaikum (let it be upon you).",
        "hadithReference": "Sahih Muslim 2165 c",
        "hadithNarrated": "'A'isha reported that some Jews came to Allah's Apostle (may peace be upon him) and they said:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":2591",
        "hadithText": "Grant him permission. (and also added: ) He is a bad son of his tribe or he is a bad person of his tribe. When he came in he used kind words for him. 'A'isha reported that she said: Allah's Messenger, you said about him what you had to say and then you treated him with kindness. He said: A'isha, verily in the eye of Allah, worst amongst the person in rank on the Day of Resurrection is one whom the people abandon or desert out of the fear of indecency.",
        "hadithReference": "Sahih Muslim 2591 a",
        "hadithNarrated": "A'isha reported that a person sought permission from Allah's Apostle (may peace be upon him) to see him. He said:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":665",
        "hadithText": "\"When the Prophet became seriously ill and his disease became aggravated he asked for permission \nfrom his wives to be nursed in my house and he was allowed. He came out with the help of two men \nand his legs were dragging on the ground. He was between Al-`Abbas and another man.\" \n'Ubaidullah said, \"I told Ibn `Abbas what `Aisha had narrated and he said, 'Do you know who was the \n(second) man whose name `Aisha did not mention'\" I said, 'No.' Ibn `Abbas said, 'He was `Ali Ibn Abi \nTalib.' \"",
        "hadithReference": "Sahih al-Bukhari 665",
        "hadithNarrated": "Narrated `Aisha:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":1147",
        "hadithText": "I asked `Aisha, \"How is the prayer of Allah's Apostle during the month of Ramadan.\" She said, \n\"Allah's Apostle never exceeded eleven rak`at in Ramadan or in other months; he used to offer four \nrak`at-- do not ask me about their beauty and length, then four rak`at, do not ask me about their beauty \nand length, and then three rak`at.\" Aisha further said, \"I said, 'O Allah's Apostle! Do you sleep before \noffering the witr prayer?' He replied, 'O `Aisha! My eyes sleep but my heart remains awake'!\"",
        "hadithReference": "Sahih al-Bukhari 1147",
        "hadithNarrated": "Narrated Abu Salma bin `Abdur Rahman:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":2655",
        "hadithText": "The Prophet heard a man (reciting Qur'an) in the Mosque, and he said, \"May Allah bestow His Mercy \nupon him. No doubt, he made me remember such-and such Verses of such-and-such Sura which I \ndropped (from my memory). \nNarrated Aisha: The Prophet performed the Tahajjud prayer in my house, and then he heard the voice \nof `Abbad who was praying in the Mosque, and said, \"O `Aisha! Is this `Abbad's voice?\" I said, \"Yes.\" \nHe said, \"O Allah! Be merciful to `Abbad!\"",
        "hadithReference": "Sahih al-Bukhari 2655",
        "hadithNarrated": "Narrated `Aisha:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":4025",
        "hadithText": "I heard Az-Zuhri saying, \"I heard `Urwa bin Az-Zubair. Sa`id bin Al-Musaiyab, 'Alqama bin Waqqas \nand 'Ubaidullah bin `Abdullah each narrating part of the narrative concerning `Aisha the wife of the \nProphet. `Aisha said: When I and Um Mistah were returning, Um Mistah stumbled by treading on the \nend of her robe, and on that she said, 'May Mistah be ruined.' I said, 'You have said a bad thing, you \ncurse a man who took part in the battle of Badr!.\" Az-Zuhri then narrated the narration of the Lie \n(forged against `Aisha).",
        "hadithReference": "Sahih al-Bukhari 4025",
        "hadithNarrated": "Narrated Yunus bin Yazid:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":4145",
        "hadithText": "I started abusing Hassan in front of `Aisha. She said, \"Do not abuse him as he used to defend Allah's \nApostle (against the infidels). `Aisha added, \"Once Hassan took the permission from the Prophet to \nsay poetic verses against the infidels. On that the Prophet said, 'How will you exclude my forefathers \n(from that)? Hassan replied, 'I will take you out of them as one takes a hair out of the dough.\" \nHisham's father added, \"I abused Hassan as he was one of those who spoke against `Aisha.\"",
        "hadithReference": "Sahih al-Bukhari 4145",
        "hadithNarrated": "Narrated Hisham's father:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":4756",
        "hadithText": "Hassan came to Aisha and said the following poetic Verse: 'A chaste pious woman who arouses no \nsuspicion. She never talks against chaste heedless women behind their backs.' `Aisha said, \"But you \nare not,\" I said (to `Aisha), \"Why do you allow such a person to enter upon you after Allah has \nrevealed: \n\"...and as for him among them who had the greater share therein'?\" (24.11) \nShe said, \"What punishment is worse than blindness?\" She added, \"And he used to defend Allah's \nApostle against the pagans (in his poetry).",
        "hadithReference": "Sahih al-Bukhari 4756",
        "hadithNarrated": "Narrated Masruq:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":5099",
        "hadithText": "(the wife of the Prophet) that while Allah's Apostle was with her, she heard a voice of a man asking \npermission to enter the house of Hafsa. `Aisha added: I said, \"O Allah's Apostle! This man is asking \npermission to enter your house.\" The Prophet said, \"I think he is so-and-so,\" naming the foster-uncle \nof Hafsa. `Aisha said, \"If so-and-so,\" naming her foster uncle, \"were living, could he enter upon me?\" \nThe Prophet said, \"Yes, for foster suckling relations make all those things unlawful which are \nunlawful through corresponding birth (blood) relations.\"",
        "hadithReference": "Sahih al-Bukhari 5099",
        "hadithNarrated": "Narrated `Aisha:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":6030",
        "hadithText": "`Aisha said that the Jews came to the Prophet and said, \"As-Samu 'Alaikum\" (death be on you). \n`Aisha said (to them), \"(Death) be on you, and may Allah curse you and shower His wrath upon you!\" \nThe Prophet said, \"Be calm, O `Aisha ! You should be kind and lenient, and beware of harshness and \nFuhsh (i.e. bad words).\" She said (to the Prophet), \"Haven't you heard what they (Jews) have said?\" \nHe said, \"Haven't you heard what I have said (to them)? I said the same to them, and my invocation \nagainst them will be accepted while theirs against me will be rejected (by Allah). \"",
        "hadithReference": "Sahih al-Bukhari 6030",
        "hadithNarrated": "Narrated `Abdullah bin Mulaika:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":6401",
        "hadithText": "`Aisha said, \"The Jews came to the Prophet and said to him, \"As-Samu 'Alaika (i.e., Death be upon \nyou).\" He replied, 'The same on you.' \" `Aisha said to them, \"Death be upon you, and may Allah curse \nyou and shower His wrath upon you!\" Allah's Apostle I said, \"Be gentle and calm, O `Aisha! Be \ngentle and beware of being harsh and of saying evil things.\" She said, \"Didn't you hear what they \nsaid?\" He said, \"Didn't you hear what I replied (to them)? have returned their statement to them, and \nmy invocation against them will be accepted but theirs against me will not be accepted.\"",
        "hadithReference": "Sahih al-Bukhari 6401",
        "hadithNarrated": "Narrated Ibn Abi Mulaika:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":6758",
        "hadithText": "Aisha said, \"I bought Barira and her masters stipulated that the Wala would be for them.\" Aisha \nmentioned that to the Prophet and he said, \"Manumit her, as the Wala is for the one who gives the \nsilver (i.e. pays the price for freeing the slave).\" Aisha added, \"So I manumitted her. After that, the \nProphet caller her (Barira) and gave her the choice to go back to her husband or not. She said, \"If he \ngave me so much and so much (money) I would not stay with him.\" So she selected her ownself (i.e. \nrefused to go back to her husband).\"",
        "hadithReference": "Sahih al-Bukhari 6758",
        "hadithNarrated": "Narrated Al-Aswad:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":7100",
        "hadithText": "When Talha, AzZubair and `Aisha moved to Basra, `Ali sent `Ammar bin Yasir and Hasan bin `Ali \nwho came to us at Kufa and ascended the pulpit. Al-Hasan bin `Ali was at the top of the pulpit and \n`Ammar was below Al-Hasan. We all gathered before him. I heard `Ammar saying, \"`Aisha has \nmoved to Al-Busra. By Allah! She is the wife of your Prophet in this world and in the Hereafter. But \nAllah has put you to test whether you obey Him (Allah) or her (`Aisha).",
        "hadithReference": "Sahih al-Bukhari 7100",
        "hadithNarrated": "Narrated Abu Maryam `Abdullah bin Ziyad Al-Aasadi:"
    },
    {
        "bookName": "urn",
        "hadithNumber": "/506490",
        "hadithText": "Yahya related to me from Malik from Abu'n-Nadr, the mawla of Umar\nibn Ubaydullah that A'isha bint Talha told him that she was once with\nA'isha, the wife of the Prophet, may Allah bless him and grant him\npeace, and her husband, who was fasting, came and visited her there.\n(He was Abdullah ibn Abd ar-Rahman ibn Abi Bakras-Siddiq.) A'isha said\nto him, \"What's stopping you from coming close to your wife and\nkissing her and joking with her?\"  He said, \"Can I kiss her when I am\nfasting?\"  She said, \"Yes.\"",
        "hadithReference": "Unknown",
        "hadithNarrated": "Unknown"
    },
    {
        "bookName": "urn",
        "hadithNumber": "/511660",
        "hadithText": "Yahya related to me from Malik from Abd ar-Rahman ibn al-Qasim\nfrom his father that A'isha, umm al-muminin, proposed to Qurayba bint\nAbi Umayya on behalf of Abd ar-Rahman ibn Abi Bakr. They married her\nto him and her people found fault with Abd ar-Rahman and said, \"We\nonly gave in marriage because of A'isha.\" A'isha therefore sent for\nAbd ar-Rahman and told him about it. He gave Qurayba authority over\nherself and she chose her husband and so there was no divorce.",
        "hadithReference": "Unknown",
        "hadithNarrated": "Unknown"
    },
    {
        "bookName": "riyadussalihin",
        "hadithNumber": ":1679",
        "hadithText": "The Messenger of Allah (PBUH) visited me after returning from a journey, and I had a shelf with a thin cloth curtain hanging over it and on which there were portraits. When he saw it, the colour of his face changed (because of anger) and he said, \"O 'Aishah! the most grievous torment from Allah on the Day of Resurrection will be for those who imitate (Allah) in the act of His creation.\" 'Aishah said: We tore it into pieces and made a cushion or two cushions out of that.[Al-Bukhari and Muslim].",
        "hadithReference": "Riyad as-Salihin 1679",
        "hadithNarrated": "'Aishah (May Allah be pleased with her) said:"
    },
    {
        "bookName": "nasai",
        "hadithNumber": ":1481",
        "hadithText": "\"When the sun was eclipsed during the time of the Messenger of Allah (SAW), he performed wudu' and ordered that the call be given: 'As-salatu jami'ah.' He stood for a long time in prayer,\" and 'Aishah said: \"I thought that he recited Surah Al-Baqarah. Then he bowed for a long time, then he said: Sami' Allahu liman hamidah. Then he bowed, then prostrated. Then he stood up and did the same again, bowing twice and prostrating once. Then he sat and the eclipse ended.\"",
        "hadithReference": "Sunan an-Nasa'i 1481",
        "hadithNarrated": "Abu Hafs, the freed slave of 'Aishah, narrated that 'Aishah told him:"
    },
    {
        "bookName": "nasai",
        "hadithNumber": ":1947",
        "hadithText": "\"One of the children of the Ansar (who had died) was brought to the Messenger of Allah so he prayed for him.\" 'Aishah said: \"How fortunate he is, one of the little birds of Paradise. He never did any evil or reached the age of puberty.\" He said: \"It is better not to say anything, O 'Aishah Allah, the Mighty and Sublime, created Paradise and created people for it, He created them in the loins of their fathers. And He created Hell and created people for it, and He created them in the loins of their fathers.\"",
        "hadithReference": "Sunan an-Nasa'i 1947",
        "hadithNarrated": "The mother of the believers, 'Aishah, said:"
    },
    {
        "bookName": "nasai",
        "hadithNumber": ":3313",
        "hadithText": "\"I said: 'O Messenger of Allah, there is a man asking permission to enter your house.' The Messenger of Allah said: 'I think it is so-and-so the paternal uncle of Hafsah through breast-feeding.' 'Aishah said: If so-and-so (her own paternal uncle through breast-feeding) were alive, would he be allowed to enter upon me?' The Messenger of Allah said: 'What becomes unlawful (for marriage) through breast-feeding is that which becomes unlawful through birth.'\"",
        "hadithReference": "Sunan an-Nasa'i 3313",
        "hadithNarrated": "It was narrated from 'Amrah that 'Aishah told her that the Messenger of Allah was with her, and she heard a man asking permission to enter Hafsah's house. 'Aishah said:"
    },
    {
        "bookName": "nasai",
        "hadithNumber": ":196",
        "hadithText": "\"O Messenger of Allah! Allah is not shy to tell the truth. Inform me: if a women sees in a dream what men see should she perform Ghusl from that?\" The Messenger of Allah (PBUH) said to her: \"Yes.\" 'Aishah said: \"I expressed my displeasure and said: 'Does a woman see that?' The Messenger of Allah (PBUH) turned to me and said: 'May your right hand be covered with dust! How else would (her child) resemble her?'\"",
        "hadithReference": "Sunan an-Nasa'i 196",
        "hadithNarrated": "It was narrated from 'Urwah that 'Aishah told him that Umm Sulaim spoke to the Messenger of Allah (PBUH) when 'Aishah was sitting there. She said to him:"
    },
    {
        "bookName": "abudawud",
        "hadithNumber": ":76",
        "hadithText": "Dawud ibn Salih ibn Dinar at-Tammar quoted his mother as saying that her mistress sent her with some pudding (harisah) to Aisha who was offering prayer. She made a sign to me to place it down. A cat came and ate some of it, but when Aisha finished her prayer, she ate from the place where the cat had eaten.  She stated: The Messenger of Allah (saws) said: It is not unclean: it is one of those who go round among you. She added: I saw the Messenger of Allah (saws) performing ablution from the water left over by the cat.",
        "hadithReference": "Sunan Abi Dawud 76",
        "hadithNarrated": "Narrated Aisha, Ummul Mu'minin:"
    },
    {
        "bookName": "abudawud",
        "hadithNumber": ":4808",
        "hadithText": "Al-Miqdam ibn Shurayh, quoting his father, said: I asked Aisha about living in the desert. She said: The Messenger of Allah (saws) used to go to the desert to these rivulets. Once he intended to go to the desert and he sent to me a she-camel from the camel of sadaqah which had not been used for riding so far. He said to me: Aisha! show gentleness, for if gentleness is found in anything, it beautifies it and when it is taken out from anything it damages it.\n\n\n\nIbn al-Sabbah said in his version: Muharramah means a mount which has not been used for riding.",
        "hadithReference": "Sunan Abi Dawud 4808",
        "hadithNarrated": "Narrated Aisha, Ummul Mu'minin:"
    },
    {
        "bookName": "abudawud",
        "hadithNumber": ":1341",
        "hadithText": "How did the Messenger of Allah (saws) pray during Ramadhan ? She said: The Messenger of Allah (saws) did not pray more than eleven rak'ahs during Ramadhan and other than Ramadhan. He would pray four rak'ahs. Do not ask about their elegance and length. He then would pray for rak'ahs. Do not ask about their alegance and length. Then he would pray three rak'ahs. 'Aishah said: I asked: Messenger of Allah, do you sleep before observing witr ? He replied: 'Aishah, my eyes sleep, but my heart does not sleep.",
        "hadithReference": "Sunan Abi Dawud 1341",
        "hadithNarrated": "Abu Salamah b. 'Abd al-Rahman asked 'Aishah, the wife of the Prophet (saws):"
    },
    {
        "bookName": "ibnmajah",
        "hadithNumber": ":1973",
        "hadithText": "that the Messenger of Allah became angry with Safiyyah bint Huyai for something, and Safiyyah said: \"O 'Aishah, can you make the Messenger of Allah be pleased with me, and I will give you my day?\" She said: \"Yes.\" So she took a headcover of hers that was dyed with saffron and sprinkled it with water so that its fragrance would become stronger, then she sat beside the Messenger of Allah. The Prophet said: \"O 'Aishah, go away, because it is not your day!\" She said: \"That is the Grace of Allah which He bestows on whom He pleases.\" Then she told him about that matter and he was pleased with her.",
        "hadithReference": "Sunan Ibn Majah 1973",
        "hadithNarrated": "It was narrated from 'Aishah:"
    },
    {
        "bookName": "mishkat",
        "hadithNumber": ":2080",
        "hadithText": "When Hafsa and I were fasting we were offered food which we liked very much and ate some of it. Hafsa told God’s messenger of this, and he said, “Make up for it by fasting on another day.” \n\nTirmidhi transmitted it, but he mentioned a number of huffaz* who transmitted on the authority of Zuhri on the authority of ‘A'isha in mursal form, omitting to mention ‘Urwa’s authority, and this is sounder. Abu Dawud transmitted it from Zumail the client of ‘Urwa from ‘Urwa from ‘A'isha.\n*Traditionists who have a reputation for their accurate memory.",
        "hadithReference": "Mishkat al-Masabih 2080",
        "hadithNarrated": "Zuhri reported on ‘Urwa’s authority that ‘A'isha said:"
    },
    {
        "bookName": "adab",
        "hadithNumber": ":89",
        "hadithText": "Anas ibn Malik said, \"A woman came to 'A'isha and 'A'isha gave her three\ndates. She gave each of her two children a date and kept one date for herself.\nThe children ate the two dates and then looked at their mother. She took\nher date and split it into two and gave each child a half of it. The Prophet,\nmay Allah bless him and grant him peace, came and 'A'isha told him about\nit. He said, 'Are you surprised at that? Allah will show her mercy because\nof her mercy towards her child.'\"",
        "hadithReference": "Al-Adab Al-Mufrad 89",
        "hadithNarrated": "Unknown"
    },
    {
        "bookName": "adab",
        "hadithNumber": ":311",
        "hadithText": "'A'isha reported that some Jews came to the Prophet, may Allah\nbless him and grant him peace, and said, \"Poison ('sam' instead\nof 'salam') be upon you.\" 'A'isha said, \"And upon you and may the\ncurse of Allah and the anger of Allah be upon you!\" The Prophet said, \"Easy,\n'A'isha, you must be gentle. Beware of harshness and coarseness.\" She asked,\n\"Didn't you hear what they said?\" He said, \"Didn't you hear what I said?\nI repeated it to them and what I said about them will be accepted and what\nthey said about me will not be accepted.\"",
        "hadithReference": "Al-Adab Al-Mufrad 311",
        "hadithNarrated": "Unknown"
    },
    {
        "bookName": "adab",
        "hadithNumber": ":559",
        "hadithText": "'A'isha reported that the wives of the Prophet, may Allah bless\nhim and grant him peace, sent Fatima to the Prophet and she asked for permission\nto enter while the Prophet, may Allah bless him and grant him peace, was\nwith 'A'isha, may Allah be pleased with her, who was wearing a wool dress.\nHe gave her permission to enter and she came in. She said, \"Your wives\nhave sent me to ask you for justice regarding the daughter of Abu Quhafa\n(i.e. 'A'isha).\" He said, \"Daughter, do you love what I love?\" \"Yes,\" she\nreplied. He said, \"Then love this woman.\"",
        "hadithReference": "Al-Adab Al-Mufrad 559",
        "hadithNarrated": "Unknown"
    },
    {
        "bookName": "bulugh",
        "hadithNumber": "/12/31",
        "hadithText": "Muslim has also reported on the authority of 'Aishah (RAA), \"Allah's Messenger (PBUH) ordered a horned ram with black legs, a black belly and black around its eyes, and it was brought for him to sacrifice and he said to 'Aishah (RAA), \"Aishah, get the knife.\" Then he said, \"Sharpen it with a stone.\" When she had done so he took it, then taking it (the ram) he placed it on the ground and slaughtered it. He then said, \"Bismillah (In the name of Allah), O Allah, accept it from Muhammad, Muhammad's family and from Muhammad's Ummah (followers).\" (Then he sacrificed it.'",
        "hadithReference": "Unknown",
        "hadithNarrated": "Unknown"
    },
    {
        "bookName": "bulugh",
        "hadithNumber": "/2/281",
        "hadithText": "Allah's Messenger (SAW) did not offer more than eleven (voluntary) Rak'at during Ramadan nor during other than Ramadan. He offered four Rak'at - Do not ask about their beauty and length! (It is beyond description or imitation]. Again he would pray four Rak'at - Do not ask about their beauty and length! [It is beyond description or imitation]. Then he would pray three (Rak'at of Witr). 'Aishah (RA) said, \"I said, O Allah's Messenger will you sleep before you pray Witr?\" He said, \"O 'Aishah my eyes sleep, but my heart does not sleep.\"\n\n[Agreed upon].",
        "hadithReference": "Unknown",
        "hadithNarrated": "Narrated 'Aishah (RA):"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":240",
        "hadithText": "Abdullah, the freed slave of Shahddad, came to 'A'isha and transmitted from her a hadith like this (which she narrated) from the Holy Prophet (may peace be upon him).",
        "hadithReference": "Sahih Muslim 240b",
        "hadithNarrated": "Unknown"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":240",
        "hadithText": "I was in the presence of 'A'isha, and then narrated on her authority a hadith like this from the Holy Prophet (way peace be upon him).",
        "hadithReference": "Sahih Muslim 240d",
        "hadithNarrated": "Salim, the freed slave of Shaddad b. al-Had said:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":268",
        "hadithText": "The Messenger of Allah (way peace be upon him) loved to start from the right-hand side for performing ablution, for combing (the hair) and wearing the shoes.",
        "hadithReference": "Sahih Muslim 268a",
        "hadithNarrated": "'A'isha reported:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":268",
        "hadithText": "The Messenger of Allah (may peace be upon him) loved to start from the right-hand side in his every act i. e. in wearing shoes, in combing (his hair) and in performing ablution.",
        "hadithReference": "Sahih Muslim 268b",
        "hadithNarrated": "'A'isha reported:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":286",
        "hadithText": "A suckling babe was brought to the Messenger of Allah (way peace be upon him) and he urinated in his tap. He (the Holy Prophet) sent for water and poured it over.",
        "hadithReference": "Sahih Muslim 286b",
        "hadithNarrated": "A'isha reported:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":288",
        "hadithText": "I used to scrape off the (drop of) semen from the garment of the Messenger of Allah (may peace be upon him).",
        "hadithReference": "Sahih Muslim 288b",
        "hadithNarrated": "Al-Aawad and Hammam reported A'isha as saying:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":297",
        "hadithText": "I used to wash the head of the Messenger of Allah (may peace be upon him), while I was in a state of menstruation.",
        "hadithReference": "Sahih Muslim 297 e",
        "hadithNarrated": "Al-Aswad narrated it from 'A'isha that she observed:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":305",
        "hadithText": "Whenever the Messenger of Allah (may peace be upon him) intended to sleep after having sexual intercourse, he performed ablution as for the prayer before going to sleep.",
        "hadithReference": "Sahih Muslim 305 a",
        "hadithNarrated": "'A'isha reported:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":305",
        "hadithText": "Whenever the Messenger of Allah (may peace be upon him) had sexual intercourse and intended to eat or sleep, he performed the ablution of prayer.",
        "hadithReference": "Sahih Muslim 305 b",
        "hadithNarrated": "'A'isha reported:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":319",
        "hadithText": "The Messenger of Allah (may peace be upon him) washed himself with water from a vessel (measuring seven to eight seers) because of sexual intercourse.",
        "hadithReference": "Sahih Muslim 319 a",
        "hadithNarrated": "'A'isha reported:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":334",
        "hadithText": "I The daughter of jahsh had been mustabida for seven years,\" and the rest of the hadith is the same (as mentioned above).",
        "hadithReference": "Sahih Muslim 334 d",
        "hadithNarrated": "The hadith has been narrated by 'A'isha through another chain of transmitters (in these words):"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":381",
        "hadithText": "Ibn Umm Maktum used to pronounce Adhan at the behest of the Messenger of Allah (may peace be upon him) (despite the fact) that he was blind.",
        "hadithReference": "Sahih Muslim 381 a",
        "hadithNarrated": "A'isha reported:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":487",
        "hadithText": "All Glorious, All Holy, Lord of the Angels and the Spirit.",
        "hadithReference": "Sahih Muslim 487 a",
        "hadithNarrated": "'A'isha reported that the Messenger of Allah (may peace he upon him) used to pronounce while bowing and prostrating himself:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":500",
        "hadithText": "The Messenger of Allah (may peace be upon him) was asked in the expedition of Tabuk about the sutra the worshipper; he said: Like the back of the saddle.",
        "hadithReference": "Sahih Muslim 500 b",
        "hadithNarrated": "'A'isha reported:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":512",
        "hadithText": "The Prophet (may peace be upon him) used to pray at night while I lay interposed between him and the Qibla like a corpse on the bier.",
        "hadithReference": "Sahih Muslim 512 a",
        "hadithNarrated": "'A'isha reported:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":528",
        "hadithText": "The wives of the Apostle of Allah (may peace be Upon him) made a mention of the church which they had seen in Abyssinia which was called Marya, and the rest of the hadith is the same.",
        "hadithReference": "Sahih Muslim 528 c",
        "hadithNarrated": "'A'isha reported:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":586",
        "hadithText": "Never did he (the Holy Prophet) say prayer after this in which I did not hear him seeking refuge from the torment of the grave.",
        "hadithReference": "Sahih Muslim 586 b",
        "hadithNarrated": "Masruq reported this hadith on the authority of 'A'isha who said:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":587",
        "hadithText": "1 heard the Messenger of Allah (may peace be upon him) seeking refuge from the trial of Dajjal (Antichrist) in prayer.",
        "hadithReference": "Sahih Muslim 587",
        "hadithNarrated": "'A'isha reported:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":592",
        "hadithText": "\" 0 Possessor of Glory and Honour.\"",
        "hadithReference": "Sahih Muslim 592 c",
        "hadithNarrated": "A hadith like this has been transmitted by Abdullah b. Harith on the authority of A'isha except for the words that he (the Holy Prophet) used to say:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":685",
        "hadithText": "'A'isha, the wife of the Messenger of Allah (may peace be upon him), said Allah prescribed the prayer as two rak'ahs, then it was completed (to four rak'ahs) at the place of residence, but was retained in the same position in journey as it was first made obligatory.",
        "hadithReference": "Sahih Muslim 685 b",
        "hadithNarrated": "Unknown"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":719",
        "hadithText": "The Messenger of Allah (may peace be upon him) used to observe four rak'ahs in the forenoon prayer and he sometimes observed more as Allah pleased.",
        "hadithReference": "Sahih Muslim 719 c",
        "hadithNarrated": "Mua'ada 'Adawiyya reported 'A'isha as saying:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":724",
        "hadithText": "'A'isha reported that the Apostle of Allah (may peace be upon him) used to observe two (supererogatory) rak'ahs in between the call to prayer and the Iqama of the dawn prayer.",
        "hadithReference": "Sahih Muslim 724 c",
        "hadithNarrated": "Unknown"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":724",
        "hadithText": "When it was dawn, the Messenger of Allah (may peace be upon him) observed two rak'ahs, and I would say: Does he recite only the opening chapter of the Qur'an in it?",
        "hadithReference": "Sahih Muslim 724 e",
        "hadithNarrated": "'A'isha reported:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":724",
        "hadithText": "'A'isha reported that the Apostle (may peace be upon him) was not so much particular about observing supererogatory rak'ahs as in case of the two rak'ahs of the dawn prayer.",
        "hadithReference": "Sahih Muslim 724 f",
        "hadithNarrated": "Unknown"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":724",
        "hadithText": "I have never seen the Messenger of Allah (may peace be upon him) hastening as much in observing supererogatory as two rak'ahs before the (Fard) of the dawn prayer.",
        "hadithReference": "Sahih Muslim 724 g",
        "hadithNarrated": "'A'isha reported:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":725",
        "hadithText": "They are dearer to me than the whole world.",
        "hadithReference": "Sahih Muslim 725 b",
        "hadithNarrated": "'A'isha reported that the Apostle of Allah (may peace be upon him) said about the two (supererogatory) rak'ahs of the dawn:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":732",
        "hadithText": "I said to 'A'isha and she made a mention of that (recorded above) about the Apostle of Allah (may peace be upon him).",
        "hadithReference": "Sahih Muslim 732 b",
        "hadithNarrated": "'Abdullah b. Shaqiq reported:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":732",
        "hadithText": "'A'isha reported that the Messenger of Allah (may peace be upon him) died (in this very state) that he observed most of his (Nafl) prayers in a sitting position.",
        "hadithReference": "Sahih Muslim 732 c",
        "hadithNarrated": "Unknown"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":732",
        "hadithText": "When the Messenger of Allah (may peace be upon him) grew bulky and heavy he would observe (most of his Nafl) prayers sitting.",
        "hadithReference": "Sahih Muslim 732 d",
        "hadithNarrated": "'A'isha reported:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":737",
        "hadithText": "The Messenger of Allah (may peace be upon him) used to observe thirteen rak'ahs of the night prayer. Five out of them consisted of Witr, and he did not sit, but at the end (for salutation).",
        "hadithReference": "Sahih Muslim 737 a",
        "hadithNarrated": "'A'isha reported:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":737",
        "hadithText": "'A'isha reported that the Messenger of Allah (may peace be upon him) used to pray thirteen rak'ahs during the night including the two rak'ahs (Sunan) of the dawn prayer.",
        "hadithReference": "Sahih Muslim 737 c",
        "hadithNarrated": "Unknown"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":742",
        "hadithText": "Never did the earlier part of the dawn find the Messenger of Allah (may peace be upon him) but sleeping in my house or near me.",
        "hadithReference": "Sahih Muslim 742",
        "hadithNarrated": "'A'isha reported:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":745",
        "hadithText": "'A'isha reported that the Messenger of Allah (may peace be upon him) used to observe Witr every night, and he would (at times) complete his Witr at the end of the night.",
        "hadithReference": "Sahih Muslim 745 c",
        "hadithNarrated": "Unknown"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":746",
        "hadithText": "'A'isha reported that when the Messenger of Allah (may peace be upon him) missed the night prayer due to pain or any other reason, he observed twelve rak'ahs during the daytime.",
        "hadithReference": "Sahih Muslim 746 e",
        "hadithNarrated": "Unknown"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":767",
        "hadithText": "'A'isha reported that when the Messenger of Allah (may peace be upon him) stood up at night to pray, he began his prayer with two short rak'ahs.",
        "hadithReference": "Sahih Muslim 767",
        "hadithNarrated": "Unknown"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":782",
        "hadithText": "That which is done continuously, even if it is small.",
        "hadithReference": "Sahih Muslim 782 b",
        "hadithNarrated": "'A'isha is reported to have said that the Messenger of Allah (may peace be upon him) was asked about the act most pleasing to Allah. He replied:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":833",
        "hadithText": "'A'isha reported that 'Umar misconstrued the fact that the Messenger of Allah (may peace be upon him) had prohibited the observance of prayer at the time of the rising sun and at the time of its setting.",
        "hadithReference": "Sahih Muslim 833 a",
        "hadithNarrated": "Unknown"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":835",
        "hadithText": "The Messenger of Allah (may peace be upon him) did not abandon at all observing two rak'ahs after the 'Asr in my house.",
        "hadithReference": "Sahih Muslim 835 b",
        "hadithNarrated": "'A'isha reported:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":835",
        "hadithText": "Two are the prayers which the Messenger of Allah (may peace be upon him) always observed in my house-openly or secretly-two rak'ahs before the dawn and two rak'ahs after the 'Asr.",
        "hadithReference": "Sahih Muslim 835 c",
        "hadithNarrated": "'A'isha reported:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":847",
        "hadithText": "The people (mostly) were workers and they had no servants. Ill-smell thus emitted out of them. It was said to them: Were you to take bath on Friday.",
        "hadithReference": "Sahih Muslim 847 b",
        "hadithNarrated": "'Aisha reported:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":941",
        "hadithText": "I asked 'A'isha with how many garments the Messenger of Allah (may peace be upon him) was shourded. She said: With three garments of Sahul.",
        "hadithReference": "Sahih Muslim 941 d",
        "hadithNarrated": "Abu Salama said:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":947",
        "hadithText": "If a company of Muslims numbering one hundred pray over a dead person, all of them interceding for him, their intercession for him will be accepted.",
        "hadithReference": "Sahih Muslim 947",
        "hadithNarrated": "'A'isha reported Allah's Apostle (may peace be upon him) saying:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":1106",
        "hadithText": "'Urwa b. Zubair narrated that 'A'isha the Mother of the Believers (Allah be pleased with her) informed him that the Messenger of Allah (may peace be upon him) kissed her while fasting.",
        "hadithReference": "Sahih Muslim 1106 i",
        "hadithNarrated": "Unknown"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":1106",
        "hadithText": "'A'isha (Allah be pleased with her) reported that Allah's Messenger (may peace be upon him) kissed (his wives) during Ramadan while observing fast.",
        "hadithReference": "Sahih Muslim 1106 l",
        "hadithNarrated": "Unknown"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":1140",
        "hadithText": "'A'isha (Allah be pleased with her) said that the Prophet (may peace be upon him) forbade to observe fast on two days-the day of Fitr and the day of Adha.",
        "hadithReference": "Sahih Muslim 1140",
        "hadithNarrated": "Unknown"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":1169",
        "hadithText": "Look for (and in the words of Waki, seek) Lailat-ul-Qadr in the last ten nights of Ramadan.",
        "hadithReference": "Sahih Muslim 1169",
        "hadithNarrated": "'A'isha (Allah be pleased with her) and Ibn Numair reported Allah's Messenger (may peace be upon him) as saying:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":1175",
        "hadithText": "'A'isha (Allah be pleased with her) reported that Allah's Messenger (may peace be upon him) used to exert himself in devotion during the last ten nights to a greater extent than at any other time.",
        "hadithReference": "Sahih Muslim 1175",
        "hadithNarrated": "Unknown"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":1176",
        "hadithText": "I never saw the Messenger of Allah (may peace be upon him) fasting in the ten days of Dhu'I-Hijja.",
        "hadithReference": "Sahih Muslim 1176 a",
        "hadithNarrated": "'A'isha (Allah be pleased with her) reported:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":1189",
        "hadithText": "I applied perfume to the Messenger of Allah (may peace be upon him) before he entered upon the state of lhram and (concluding) before circumambulating the (sacred) House.",
        "hadithReference": "Sahih Muslim 1189 a",
        "hadithNarrated": "'A'isha (Allah be pleased with her) reported:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":1189",
        "hadithText": "I applied perfume to the Messenger of Allah (may peace be upon him) as he became free from Ihram and as he entered upon it.",
        "hadithReference": "Sahih Muslim 1189 d",
        "hadithNarrated": "'A'isha (Allah be pleased with her) said:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":1189",
        "hadithText": "I applied perfume of Dharira to the Messenger of Allah (may peace be upon him) with my hand (on the occasion of) the Farewell Pilgrimage on freeing from the state of Ihram and entering upon it.",
        "hadithReference": "Sahih Muslim 1189 e",
        "hadithNarrated": "'A'isha (Allah be pleased with her) said:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":1190",
        "hadithText": "I still seem to see the glistening of the perfume where the hair parted on Allah's Messenger's (may peace be upon him) head and he was free from Ihram.",
        "hadithReference": "Sahih Muslim 1190 b",
        "hadithNarrated": "'A'isha (Allah be pleased with her) reported:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":1190",
        "hadithText": "I still seem to see the glistening of the perfume where the hair parted on Allah's Messenger's (may peace be upon him) head, while he was pronouncing Talbiya.",
        "hadithReference": "Sahih Muslim 1190 c",
        "hadithNarrated": "'A'isha (Allah be pleased with her) reported:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":1190",
        "hadithText": "I still seem to see the glistening of the perfume where the hair was parted on Allah's Messeinger's (may peace be upon him) head while he was in the state of Ihram.",
        "hadithReference": "Sahih Muslim 1190 e",
        "hadithNarrated": "'A'isha (Allah be pleased with her) said:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":1190",
        "hadithText": "I still seem to perceive the glistening of perfume where the hair was parted on Allah's Messenger's (may peace be upon him) head as he was in the state of Ihram.",
        "hadithReference": "Sahih Muslim 1190 f",
        "hadithNarrated": "'A'isha (Allah be pleased with her) reported:"
    }
]