[
    {
        "bookName": "muslim",
        "hadithNumber": ":1190",
        "hadithText": "I still seem to see the glistening of musk (in the parting of the head) of the Messenger of Allah (may peace be upon him) while he was in the state of Ihram.",
        "hadithReference": "Sahih Muslim 1190 h",
        "hadithNarrated": "'A'isha (Allah be pleased with her) reported:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":1211",
        "hadithText": "Some among us put on Ihram for Hajj alone (Hajj Mufrad) ; some of us for Hajj and Umra together (Qiran), and some of us for Tamattal (first for Umra and after completing it for Hajj).",
        "hadithReference": "Sahih Muslim 1211 n",
        "hadithNarrated": "A'isha (Allah be pleased with her) said:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":1211",
        "hadithText": "We went out with the Messenger of Allah (may peace be upon him) pronouncing Talbiya having no explicit intention of Pilgrimage or 'Umra. The rest of the hadith is the same.",
        "hadithReference": "Sahih Muslim 1211 u",
        "hadithNarrated": "'A'isha (Allah be pleased, with her) reported:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":1213",
        "hadithText": "Jabir b. Abdullah is reported to have said that the Apostle of Allah (may peace be upon him) came to 'A'isha (Allah be pleased with her) and she was weeping. The rest of the hadith is the same.",
        "hadithReference": "Sahih Muslim 1213 b",
        "hadithNarrated": "Unknown"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":1258",
        "hadithText": "'A'isha (Allah be pleased with her) reported that when Allah's Messenger may peace be upon him) came to Mecca he entered from its upper side and came out from its lower side.",
        "hadithReference": "Sahih Muslim 1258 a",
        "hadithNarrated": "Unknown"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":1311",
        "hadithText": "Halt at al-Abtah is not the Sunnah. Allah's Messenger (may peace be upon him) halted there simply because it was easier for him to depart from there, when he left.",
        "hadithReference": "Sahih Muslim 1311 a",
        "hadithNarrated": "'A'isha (Allah be pleased with her) reported.:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":1321",
        "hadithText": "\"As if I am seeing myself weaving the garlands for the sacrificial animals of Allah's Messenger (may peace be upon him).\"",
        "hadithReference": "Sahih Muslim 1321 c",
        "hadithNarrated": "`A'isha narrated (in another hadith narrated through another chain of transmitters) these words:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":1321",
        "hadithText": "Allah's Messenger (may peace be upon, him) sent some goats as sacrificial animals to the House and He garlanded them.",
        "hadithReference": "Sahih Muslim 1321 j",
        "hadithNarrated": "'A'isha (Allah be pleased with her) reported:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":1444",
        "hadithText": "\"What becomes unlawful through breastfeeding is that which becomes unlawful through birth.\"",
        "hadithReference": "Sahih Muslim 1444 b",
        "hadithNarrated": "'A'isha (Allah be pleased with her) reported Allah's Messenger (may peace be upon him) as saying:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":1445",
        "hadithText": "\" The brother of Abu'l-Qu'ais sought permission from her ('A'isha) (to enter the house). The rest is the same.",
        "hadithReference": "Sahih Muslim 1445 f",
        "hadithNarrated": "This hadith has been narrated on the authority of Hisham with the same chain of transmitters (and the words are):"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":1450",
        "hadithText": "One suckling or two do not make (marriage) unlawful.",
        "hadithReference": "Sahih Muslim 1450",
        "hadithNarrated": "'A'isha (Allah be pleased with her), Suwaid and Zubair reported Allah's Apostle (may peace be upon him) as saying:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":1463",
        "hadithText": "Never did I find any woman more loving to me than Sauda bint Zam'a. I wished I could be exactly like her who was passionate. As she became old, she had made over her day (which she had to spend) with Allah's Messenger (may peace be upon him) to 'A'isha. She said: I have made over my day with you to 'A'isha. So Allah's Messenger (may peace be upon him) allotted two days to 'A'isha, her own day (when it was her turn) and that of Sauda.",
        "hadithReference": "Sahih Muslim 1463 a",
        "hadithNarrated": "'A'isha (Allah be pleased with her) reported:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":1477",
        "hadithText": "Allah's Messenger (may peace be upon him) gave us the option (to get divorce) and we chose him and he did not count it a divorce.",
        "hadithReference": "Sahih Muslim 1477 d",
        "hadithNarrated": "'A'isha (Allah be pleased with her) reported:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":1603",
        "hadithText": "'A'isha (Allah be pleased with her) reported that Allah's Messenger (may peace be upon him) bought some grain from a Jew on credit and gave him a coat-of- mail of his as a pledge.",
        "hadithReference": "Sahih Muslim 1603 a",
        "hadithNarrated": "Unknown"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":1603",
        "hadithText": "Allah's Messenger (may peace be upon him) bought from a Jew grain (as loan) and pledged him his iron coat-of-mail.",
        "hadithReference": "Sahih Muslim 1603 b",
        "hadithNarrated": "'A'isha (Allah be pleased with her) reported:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":1603",
        "hadithText": "'A'isha (Allah be pleased with her) reported that Allah's Messenger (may peace be upon him) bought from a Jew grain for a specified time; and gave him iron coat-of-mail of his as a pledge.",
        "hadithReference": "Sahih Muslim 1603 c",
        "hadithNarrated": "Unknown"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":1684",
        "hadithText": "I heard Allah's Messenger (may peace be upon him) as saying: The hand (of a thief) should not be cut off but for a quarter of a dinar and what is above that.",
        "hadithReference": "Sahih Muslim 1684 d",
        "hadithNarrated": "'A'isha reported:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":1684",
        "hadithText": "The hand of the thief may not be cut off but for a quarter of a dinar and upwards.",
        "hadithReference": "Sahih Muslim 1684 e",
        "hadithNarrated": "'A'isha reported that she heard Allah's Apostle (may peace be upon him) as saying:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":1685",
        "hadithText": "'A'isha reported that during the lifetime of Allah's Messenger (may peace be upon him) the hand of the thief was not cut off for less than the price of a shield, iron coat or armour and both of them are valuable.",
        "hadithReference": "Sahih Muslim 1685 a",
        "hadithNarrated": "Unknown"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":1718",
        "hadithText": "He who innovates things in our affairs for which there is no valid (reason) (commits sin) and these are to be rejected.",
        "hadithReference": "Sahih Muslim 1718 a",
        "hadithNarrated": "'A'isha reported Allah's Messenger (may peace be upon him) as saying:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":2001",
        "hadithText": "Allah's Messenger (may peace be upon him) was asked about Bit'i, whereupon he said: Every drink that causes intoxication is forbidden.",
        "hadithReference": "Sahih Muslim 2001 a",
        "hadithNarrated": "'A'isha reported:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":2048",
        "hadithText": "The 'ajwa' dates of 'Aliya' contain healing effects and these are antidote in the early morning.",
        "hadithReference": "Sahih Muslim 2048",
        "hadithNarrated": "'A'isha reported Allah's Messenger (may peace be upon him) as saying:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":2081",
        "hadithText": "A'isha reported that Allah's Apostle (may peace be upon him) went out one morning wearing a blanket made of (camel's or sheep's) black hair with patterns of camel saddles upon it.",
        "hadithReference": "Sahih Muslim 2081",
        "hadithNarrated": "Unknown"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":2107",
        "hadithText": "He (the Holy Prophet) inclined towards that curtain and tore it with his hand.",
        "hadithReference": "Sahih Muslim 2107 g",
        "hadithNarrated": "This hadith has been narrated on the authority of A'isha through another chain of transmitters but with a slight variation of wording (and the variation is that the narrator is reported to have said):"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":2147",
        "hadithText": "'A'isha reported that the new-born infants were brought to Allah's Messenger (may peace be upon him). He blessed them and rubbed their palates with dates.",
        "hadithReference": "Sahih Muslim 2147",
        "hadithNarrated": "Unknown"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":2195",
        "hadithText": "Allah's Messenger (may peace he upon him) commanded me that I should make use of incantation for curing the influence of an evil eye.",
        "hadithReference": "Sahih Muslim 2195 c",
        "hadithNarrated": "'A'isha reported:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":2333",
        "hadithText": "When revelation descended upon Allah's Messenger (may peace be upon him) even during the cold days, his forehead perspired.",
        "hadithReference": "Sahih Muslim 2333 a",
        "hadithNarrated": "'A'isha reported:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":2410",
        "hadithText": "Allah's Messenger (may peace be upon him) went to bed one night; the rest of the hadith is the same.",
        "hadithReference": "Sahih Muslim 2410 c",
        "hadithNarrated": "'Abdullah b. 'Amir b. Rabi reported A'isha as saying:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":2445",
        "hadithText": "Would you like to ride upon my camel tonight and allow me to ride upon your camel and you would see (what you do not generally see) and I would see (what I do not see) generally? She said: Yes. So 'A'isha rode upon the camel of Hafsa and Hafsa rode upon the camel of 'A'isha and Allah's Messenger (may peace be upon him) came near the camel of 'A'isha. (whereas) Hafsa had been riding over that. He greeted her and then rode with her until they came down. She ('A'isha) thus missed (the company of the Holy Prophet) and when they sat down, 'A'isha felt jealous. She put her foot in the grass and said: O Allah, let the scorpion sting me or the serpent bite me. And so far as thy Messenger is concerned, I cannot say anything about him.",
        "hadithReference": "Sahih Muslim 2445",
        "hadithNarrated": "'A'isha reported that when Allah's Messenger (may peace be upon him) set ont on a journey, he used to cast lots amongst his wives. Once this lot came out in my favour and that of Hafsa. They (Hafsi, and 'A'isha) both went along with him and Allah's Messenger (may peace be upon him) used to travel (on camel) when it was night along with 'A'isha and talked with her. Hafsa said to 'A'isha:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":2446",
        "hadithText": "The excellence of 'A'isha over women is like the excellence of Tharid over all other foods.",
        "hadithReference": "Sahih Muslim 2446 a",
        "hadithNarrated": "Anas b. Malik reported Allah's Messenger (may peace be upon him) as saying:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":2447",
        "hadithText": "Gabriel offered you greetings and I said: So there should be peace and mercy of Allah upon him.",
        "hadithReference": "Sahih Muslim 2447 a",
        "hadithNarrated": "'A'isha reported that Allah's Messenger (may peace be upon him) said to her:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":2570",
        "hadithText": "'A'isha reported, I did not see anyone else being afflicted with more severe illness than Allah's Messenger (may peace be upon him). In the narration transmitted by 'Uthman there is a slight variation of wording.",
        "hadithReference": "Sahih Muslim 2570 a",
        "hadithNarrated": "Unknown"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":2572",
        "hadithText": "A believer does not receive (the trouble) of running a thorn or more than that but Allah elevates him in rank or effaces his sins because of that.",
        "hadithReference": "Sahih Muslim 2572 b",
        "hadithNarrated": "'A'isha reported Allah's Messenger (may peace be upon him) as saying:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":2572",
        "hadithText": "A believer does not undergo (the trouble) of running a thorn or more than that when Allah effaces his sins.",
        "hadithReference": "Sahih Muslim 2572 c",
        "hadithNarrated": "'A'isha reported Allah's Messenger (may peace be upon him) as saying:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":2572",
        "hadithText": "I heard Allah's Messenger (may peace be upon him) as saying: There is nothing (in the form of trouble) that comes to a believer even if it is the pricking of a thorn that there is decreed for him by Allah good or his sins are obliterated.",
        "hadithReference": "Sahih Muslim 2572 g",
        "hadithNarrated": "'A'isha reported:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":2970",
        "hadithText": "Never could the family of Muhammad (may peace be upon him) (afford to eat to the fill) the bread of wheat beyond three days (successively).",
        "hadithReference": "Sahih Muslim 2970 d",
        "hadithNarrated": "'A'isha reported:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":2970",
        "hadithText": "Never could the family of Muhammad (may peace. be upon him) (afford to eat) the bread of wheat for three (successive days) until he ran the course of his life.",
        "hadithReference": "Sahih Muslim 2970 e",
        "hadithNarrated": "'A'isha reported:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":2975",
        "hadithText": "'A'isha reported this hadith through other chains of transmitters also (and the words are) that Allah's Messenger (may peace be upon him) died (in a state) when the people could afford to eat only the dates and water.",
        "hadithReference": "Sahih Muslim 2975 a",
        "hadithNarrated": "Unknown"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":2975",
        "hadithText": "water and dates.",
        "hadithReference": "Sahih Muslim 2975 b",
        "hadithNarrated": "'A'isha reported that Allah's Messenger (may peace be upon him) had died in a state that they could afford to eat two things only:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":3018",
        "hadithText": "\" If you fear that you will not be able to observe equity in case of orphan girls\" ; the rest of the hadith is the same but with a slight variation of wording.",
        "hadithReference": "Sahih Muslim 3018 b",
        "hadithNarrated": "'Urwa reported that he asked 'A'isha about the words of Allah:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":3020",
        "hadithText": "\" When they came upon you from above you and from below you and when the eyes turned dull and the hearts rose up to the throats\" (xxxiii. 10) pertain to the day of Ditch.",
        "hadithReference": "Sahih Muslim 3020",
        "hadithNarrated": "'A'isha reported that these words of Allah:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":3022",
        "hadithText": "O, the son of my sister, the Muslims were commanded to seek forgiveness for the Companions of Allah's Apostle (may peace be upon him) but they reviled them.",
        "hadithReference": "Sahih Muslim 3022 a",
        "hadithNarrated": "'Urwa reported on the authority of his father that 'A'isha said to him:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":1228",
        "hadithText": "This hadith has been narrated on the authority of 'A'isha. The wife of Allah's Messenger (may peace be upon him), concerning his Tamattu' of Hajj and 'Umra and performing of Tamattu' by people in his company.",
        "hadithReference": "Sahih Muslim 1228",
        "hadithNarrated": "Unknown"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":724",
        "hadithText": "The Messenger of Allah (may peace be upon him) used to observe two rak'ahs of Sunnah (prayer) when he heard the Adhin and shortened them.",
        "hadithReference": "Sahih Muslim 724 a",
        "hadithNarrated": "'A'isha reported:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":2572",
        "hadithText": "Allah's Messenger (may peace be upon him) said: There is no trouble that comes to a believer except that it obliterates from his sins, even if it is the pricking of a thorn",
        "hadithReference": "Sahih Muslim 2572 e",
        "hadithNarrated": "'A'isha reported:"
    },
    {
        "bookName": "muslim",
        "hadithNumber": ":901",
        "hadithText": "\" The Messenger of Allah (may peace be upon him) observed six ruku's and four prostration in (two rak'ahs).\"",
        "hadithReference": "Sahih Muslim 901 g",
        "hadithNarrated": "This hadith is narrated thus on the authority of 'A'isha through another chain of transmitters:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":229",
        "hadithText": "I used to wash the traces of Janaba (semen) from the clothes of the Prophet and he used to go for \nprayers while traces of water were still on it (water spots were still visible).",
        "hadithReference": "Sahih al-Bukhari 229",
        "hadithNarrated": "Narrated `Aisha:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":286",
        "hadithText": "I asked `Aisha \"Did the Prophet use to sleep while he was Junub?\" She replied, \"Yes, but he used to \nperform ablution (before going to bed).",
        "hadithReference": "Sahih al-Bukhari 286",
        "hadithNarrated": "Narrated Abu Salama:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":310",
        "hadithText": "\"One of the wives of Allah's Apostle joined him in I`tikaf and she noticed blood and yellowish \ndischarge (from her private parts) and put a dish under her when she prayed.\"",
        "hadithReference": "Sahih al-Bukhari 310",
        "hadithNarrated": "Narrated `Aisha:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":331",
        "hadithText": "The Prophet said to me, \"Give up the prayer when your menses begin and when it has finished, wash \nthe blood off your body (take a bath) and start praying.\"",
        "hadithReference": "Sahih al-Bukhari 331",
        "hadithNarrated": "Narrated `Aisha:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":372",
        "hadithText": "Allah's Apostle used to offer the Fajr prayer and some believing women covered with their veiling \nsheets used to attend the Fajr prayer with him and then they would return to their homes unrecognized \n.",
        "hadithReference": "Sahih al-Bukhari 372",
        "hadithNarrated": "Narrated `Aisha:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":407",
        "hadithText": "(the mother of faithful believers) Allah's Apostle saw some nasal secretions, expectoration or sputum \non the wall of the mosque in the direction of the Qibla and scraped it off.",
        "hadithReference": "Sahih al-Bukhari 407",
        "hadithNarrated": "Narrated `Aisha:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":426",
        "hadithText": "The Prophet used to start every thing from the right (for good things) whenever it was possible in all \nhis affairs; for example: in washing, combing or wearing shoes.",
        "hadithReference": "Sahih al-Bukhari 426",
        "hadithNarrated": "Narrated `Aisha:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":459",
        "hadithText": "When the verses of Surat \"Al-Baqara\"' about the usury Riba were revealed, the Prophet went to the \nmosque and recited them in front of the people and then banned the trade of alcohol.",
        "hadithReference": "Sahih al-Bukhari 459",
        "hadithNarrated": "Narrated `Aisha:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":512",
        "hadithText": "The Prophet used to pray while I was sleeping across in his bed in front of him. Whenever he wanted \nto pray witr, he would wake me up and I would pray witr.",
        "hadithReference": "Sahih al-Bukhari 512",
        "hadithNarrated": "Narrated `Aisha:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":515",
        "hadithText": "(the wife of the Prophet) Allah's Apostle used to get up at night and pray while I used to lie across \nbetween him and the Qibla on his family's bed.",
        "hadithReference": "Sahih al-Bukhari 515",
        "hadithNarrated": "Narrated `Aisha:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":545",
        "hadithText": "Allah's Apostle used to offer the `Asr prayers at a time when the sunshine was still inside my chamber \nand no shadow had yet appeared in it.",
        "hadithReference": "Sahih al-Bukhari 545",
        "hadithNarrated": "Narrated `Aisha:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":546",
        "hadithText": "The Prophet used to pray the `Asr prayers at a time when the sunshine was still inside my chamber \nand no shadow had yet appeared in it.",
        "hadithReference": "Sahih al-Bukhari 546",
        "hadithNarrated": "Narrated Aisha:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":578",
        "hadithText": "The believing women covered with their veiling sheets used to attend the Fajr prayer with Allah's \nApostle, and after finishing the prayer they would return to their home and nobody could recognize \nthem because of darkness.",
        "hadithReference": "Sahih al-Bukhari 578",
        "hadithNarrated": "Narrated `Aisha:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":591",
        "hadithText": "`Aisha (addressing me) said, \"O son of my sister! The Prophet never missed two prostrations (i.e. \nrak`at) after the `Asr prayer in my house.\"",
        "hadithReference": "Sahih al-Bukhari 591",
        "hadithNarrated": "Narrated Hisham's father:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":730",
        "hadithText": "The Prophet had a mat which he used to spread during the day and use as a curtain at night. So a \nnumber of people gathered at night facing it and prayed behind him.",
        "hadithReference": "Sahih al-Bukhari 730",
        "hadithNarrated": "Narrated `Aisha:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":751",
        "hadithText": "I asked Allah's Apostle about looking hither and thither in prayer. He replied, \"It is a way of stealing \nby which Satan takes away (a portion) from the prayer of a person.\"",
        "hadithReference": "Sahih al-Bukhari 751",
        "hadithNarrated": "Narrated `Aisha:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":872",
        "hadithText": "Allah's Apostle used to offer the Fajr prayer when it was still dark and the believing women used to \nreturn (after finishing their prayer) and nobody could recognize them owing to darkness, or they could \nnot recognize one another.",
        "hadithReference": "Sahih al-Bukhari 872",
        "hadithNarrated": "Narrated `Aisha:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":1139",
        "hadithText": "I asked Aisha about the night prayer of Allah's Apostle and she said, \"It was seven, nine or eleven \nrak`at besides the two rak`at of the Fajr prayer (i.e. Sunna). \"",
        "hadithReference": "Sahih al-Bukhari 1139",
        "hadithNarrated": "Narrated Masruq:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":1161",
        "hadithText": "After offering the Sunna of the Fajr prayer, the Prophet used to talk to me, if I happen to be awake; \notherwise he would lie down till the Iqama call was proclaimed (for the Fajr prayer).",
        "hadithReference": "Sahih al-Bukhari 1161",
        "hadithNarrated": "Narrated `Aisha:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":1165",
        "hadithText": "The Prophet (p.b.u.h) used to make the two rak`at before the Fajr prayer so light that I would wonder \nwhether he recited Al-Fatiha (or not).",
        "hadithReference": "Sahih al-Bukhari 1165",
        "hadithNarrated": "Narrated `Aisha:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":1289",
        "hadithText": "(the wife of the Prophet) Once Allah's Apostle passed by (the grave of) a Jewess whose relatives were \nweeping over her. He said, \"They are weeping over her and she is being tortured in her grave.\"",
        "hadithReference": "Sahih al-Bukhari 1289",
        "hadithNarrated": "Narrated `Aisha:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":1495",
        "hadithText": "Some meat was presented to the Prophet (p.b.u.h) and it had been given to Barira (the freed slave-girl \nof Aisha) in charity. He said, \"This meat is a thing of charity for Barira but it is a gift for us.\"",
        "hadithReference": "Sahih al-Bukhari 1495",
        "hadithNarrated": "Narrated Anas:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":1520",
        "hadithText": "(the mother of the faithful believers) I said, \"O Allah's Apostle! We consider Jihad as the best deed.\" \nThe Prophet said, \"The best Jihad (for women) is Hajj Mabrur. \"",
        "hadithReference": "Sahih al-Bukhari 1520",
        "hadithNarrated": "Narrated `Aisha:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":1539",
        "hadithText": "(the wife of the Prophet (p.b.u.h) I used to scent Allah's Apostle when he wanted to assume Ihram \nand also on finishing Ihram before the Tawaf round the Ka`ba (Tawaf-al-ifada).",
        "hadithReference": "Sahih al-Bukhari 1539",
        "hadithNarrated": "Narrated `Aisha:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":1550",
        "hadithText": "I know how the Prophet used to say (Talbiya) and it was: 'Labbaika Allahumma Labbaik, Labbaika la \nsharika Laka labbaik, Inna-l-hamda wan-ni'mata Laka walmu Lk, La sharika Laka'.",
        "hadithReference": "Sahih al-Bukhari 1550",
        "hadithNarrated": "Narrated `Aisha:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":1696",
        "hadithText": "I twisted with my own hands the garlands for the Budn of the Prophet who garlanded and marked \nthem, and then made them proceed to Mecca; Yet no permissible thing was regarded as illegal for him \nthen.",
        "hadithReference": "Sahih al-Bukhari 1696",
        "hadithNarrated": "Narrated `Aisha:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":1698",
        "hadithText": "Allah's Apostle used to send the Hadi from Medina and I used to twist the garlands for his Hadi and \nhe did not keep away from any of these things which a Muhrim keeps away from.",
        "hadithReference": "Sahih al-Bukhari 1698",
        "hadithNarrated": "Narrated `Aisha:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":1699",
        "hadithText": "I twisted the garlands for the Hadis of the Prophet and then he marked and garlanded them (or I \ngarlanded them) and then made them proceed to the Ka`ba but he remained in Medina and no \npermissible thing was regarded as illegal for him then .",
        "hadithReference": "Sahih al-Bukhari 1699",
        "hadithNarrated": "Narrated `Aisha:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":1777",
        "hadithText": "I asked `Aisha (whether the Prophet had performed `Umra in Rajab). She replied, \"Allah's Apostle \nnever performed any `Umra in Rajab.\"",
        "hadithReference": "Sahih al-Bukhari 1777",
        "hadithNarrated": "Narrated 'Urwa bin Az-Zubair:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":1918",
        "hadithText": "Bilal used to pronounce the Adhan at night, so Allah's Apostle? said, \"Carry on taking your meals (eat \nand drink) till Ibn Um Maktum pronounces the Adhan, for he does not pronounce it till it is dawn.",
        "hadithReference": "Sahih al-Bukhari 1918, 1919",
        "hadithNarrated": "Narrated `Aisha:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":1925",
        "hadithText": "At times Allah's Apostle used to get up in the morning in the state of Janaba after having sexual \nrelations with his wives. He would then take a bath and fast.",
        "hadithReference": "Sahih al-Bukhari 1925, 1926",
        "hadithNarrated": "Narrated `Aisha and Um Salama:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":1943",
        "hadithText": "(the wife of the Prophet) Hamza bin `Amr Al-Aslami asked the Prophet, \"Should I fast while \ntraveling?\" The Prophet replied, \"You may fast if you wish, and you may not fast if you wish.\"",
        "hadithReference": "Sahih al-Bukhari 1943",
        "hadithNarrated": "Narrated `Aisha:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":1950",
        "hadithText": "Sometimes I missed some days of Ramadan, but could not fast in lieu of them except in the month of \nSha'ban.\" Said Yahya, a sub-narrator, \"She used to be busy serving the Prophet .\"",
        "hadithReference": "Sahih al-Bukhari 1950",
        "hadithNarrated": "Narrated `Aisha:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":1964",
        "hadithText": "Allah's Apostle forbade Al-Wisal out of mercy to them. They said to him, \"But you practice Al- \nWisal?\" He said, \"I am not similar to you, for my Lord gives me food and drink. \"",
        "hadithReference": "Sahih al-Bukhari 1964",
        "hadithNarrated": "Narrated Aisha:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":2020",
        "hadithText": "Allah's Apostle used to practice I`tikaf in the last ten nights of Ramadan and used to say, \"Look for \nthe Night of Qadr in the last ten nights of the month of Ramadan.\"",
        "hadithReference": "Sahih al-Bukhari 2020",
        "hadithNarrated": "Narrated `Aisha:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":2024",
        "hadithText": "With the start of the last ten days of Ramadan, the Prophet used to tighten his waist belt (i.e. work \nhard) and used to pray all the night, and used to keep his family awake for the prayers.",
        "hadithReference": "Sahih al-Bukhari 2024",
        "hadithNarrated": "Narrated Aisha:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":2026",
        "hadithText": "(the wife of the Prophet) The Prophet used to practice I`tikaf in the last ten days of Ramadan till he \ndied and then his wives used to practice I`tikaf after him.",
        "hadithReference": "Sahih al-Bukhari 2026",
        "hadithNarrated": "Narrated `Aisha:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":2028",
        "hadithText": "The Prophet used to (put) bend his head (out) to me while he was in I`tikaf in the mosque during my \nmonthly periods and I would comb and oil his hair.",
        "hadithReference": "Sahih al-Bukhari 2028",
        "hadithNarrated": "Narrated `Aisha:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":2045",
        "hadithText": "Allah's Apostle mentioned that he would practice I`tikaf in the last ten days of Ramadan. `Aisha asked \nhis permission to perform I`tikaf and he permitted her. Hafsa asked `Aisha to take his permission for \nher, and she did so. When Zainab bint Jahsh saw that, she ordered a tent to be pitched for her and it \nwas pitched for her. Allah's Apostle used to proceed to his tent after the prayer. So, he saw the tents \nans asked, \"What is this?\" He was told that those were the tents of Aisha, Hafsa, and Zainab. Allah's \nApostle said, \"Is it righteousness which they intended by doing so? I am not going to perform I`tikaf.\" \nSo he returned home. When the fasting month was over, he performed Itikar for ten days in the month \nof Shawwal.",
        "hadithReference": "Sahih al-Bukhari 2045",
        "hadithNarrated": "Narrated `Amra bint `Abdur-Rahman from `Aisha:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":2226",
        "hadithText": "When the last verses of Surat-al-Baqara were revealed, the Prophet went out (of his house to the \nMosque) and said, \"The trade of alcohol has become illegal.\"",
        "hadithReference": "Sahih al-Bukhari 2226",
        "hadithNarrated": "Narrated `Aisha:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":2259",
        "hadithText": "I said, \"O Allah's Apostle! I have two neighbors and would like to know to which of them I should \ngive presents.\" He replied, \"To the one whose door is nearer to you.\"",
        "hadithReference": "Sahih al-Bukhari 2259",
        "hadithNarrated": "Narrated Aisha:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":2335",
        "hadithText": "The Prophet said, \"He who cultivates land that does not belong to anybody is more rightful (to own \nit).\" `Urwa said, \"`Umar gave the same verdict in his Caliphate.\"",
        "hadithReference": "Sahih al-Bukhari 2335",
        "hadithNarrated": "Narrated `Aisha:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":2479",
        "hadithText": "Aisha said that she hung a curtain decorated with pictures (of animals) on a cupboard. The Prophet \ntore that curtain and she turned it into two cushions which remained in the house for the Prophet to sit \non.",
        "hadithReference": "Sahih al-Bukhari 2479",
        "hadithNarrated": "Narrated Al-Qasim:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":2561",
        "hadithText": "That `Aisha told him that Barirah came to seek her help in her writing of emancipation (for a certain \nsum) and that time she had not paid anything of it. `Aisha said to her, \"Go back to your masters, and if \nthey agree that I will pay the amount of your writing of emancipation and get your Wala', I will do \nso.\" Barirah informed her masters of that but they refused and said, \"If she (i.e. `Aisha) is seeking \nAllah's reward, then she can do so, but your Wala' will be for us.\" `Aisha mentioned that to Allah's \nApostle who said to her, \"Buy and manumit (free) her, as the Wala' is for the liberator.\" Allah's Apostle then \ngot up and said, \"What about the people who stipulate conditions which are not present in Allah's \nLaws? Whoever imposes conditions which are not present in Allah's Laws, then those conditions will \nbe invalid, even if he imposed these conditions a hundred times. Allah's conditions (Laws) are the \ntruth and are more solid.\"",
        "hadithReference": "Sahih al-Bukhari 2561",
        "hadithNarrated": "Narrated `Urwa:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":2595",
        "hadithText": "I said, \"O Allah's Apostle! I have two neighbors; which of them should I give a gift to?\" The Prophet \nsaid, \"(Give) to the one whose door is nearer to you.\"",
        "hadithReference": "Sahih al-Bukhari 2595",
        "hadithNarrated": "Narrated Aisha:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":2646",
        "hadithText": "That `Aisha the wife of the Prophet told her uncle that once, while the Prophet was in her house, she \nheard a man asking Hafsa's permission to enter her house. `Aisha said, \"I said, 'O Allah's Apostle! I \nthink the man is Hafsa's foster uncle.' \" `Aisha added, \"O Allah's Apostle! There is a man asking the \npermission to enter your house.\" Allah's Apostle replied, \"I think the man is Hafsa's foster uncle.\" \n`Aisha said, \"If so-and-so were living (i.e. her foster uncle) would he be allowed to visit me?\" Allah's \nApostle said, \"Yes, he would, as the foster relations are treated like blood relations (in marital affairs).",
        "hadithReference": "Sahih al-Bukhari 2646",
        "hadithNarrated": "Narrated `Amra bint `Abdur-Rahman:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":2985",
        "hadithText": "The Prophet ordered me to let `Aisha sit behind me (on the animal) and to let her perform `Umra from \nat-Tan`im.",
        "hadithReference": "Sahih al-Bukhari 2985",
        "hadithNarrated": "Narrated `Abdur-Rahman bin Abi Bakr As-Siddiq:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":3080",
        "hadithText": "I and 'Ubai bin `Umar went to `Aisha while she was staying near Thabir (i.e. a mountain). She said, \n\"There is no Migration after Allah gave His Prophet victory over Mecca.\"",
        "hadithReference": "Sahih al-Bukhari 3080",
        "hadithNarrated": "Narrated `Ata':"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":3097",
        "hadithText": "Allah's Apostle died, and there was nothing in my house that a living being could eat, except some \nbarley Lying on a shelf. So, I ate of it for a long period and measured it, and (after a short period) it \nwas consumed.",
        "hadithReference": "Sahih al-Bukhari 3097",
        "hadithNarrated": "Narrated Aisha:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":3099",
        "hadithText": "(the wife of the Prophet) When the sickness of Allah's Apostle got aggravated, he asked the \npermission of his wives that he should be treated in my house, and they permitted him.",
        "hadithReference": "Sahih al-Bukhari 3099",
        "hadithNarrated": "Narrated `Aisha:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":3175",
        "hadithText": "Once the Prophet was bewitched so that he began to imagine that he had done a thing which in fact he \nhad not done.",
        "hadithReference": "Sahih al-Bukhari 3175",
        "hadithNarrated": "Narrated Aisha:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":3234",
        "hadithText": "Whoever claimed that (the Prophet) Muhammad saw his Lord, is committing a great fault, for he only \nsaw Gabriel in his genuine shape in which he was created covering the whole horizon.",
        "hadithReference": "Sahih al-Bukhari 3234",
        "hadithNarrated": "Narrated Aisha:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":3291",
        "hadithText": "I asked the Prophet about one's looking here and there during the prayer. He replied, \"It is what Satan \nsteals from the prayer of any one of you.\"",
        "hadithReference": "Sahih al-Bukhari 3291",
        "hadithNarrated": "Narrated `Aisha:"
    },
    {
        "bookName": "bukhari",
        "hadithNumber": ":3306",
        "hadithText": "The Prophet called the Salamander, a mischief-doer. I have not heard him ordering that it should be \nkilled. Sa`d bin Waqqas claims that the Prophet ordered that it should be killed.",
        "hadithReference": "Sahih al-Bukhari 3306",
        "hadithNarrated": "Narrated Aisha:"
    }
]